doc/s-sql-l.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:55 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples L</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples L</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org33368f2">S-SQL Examples Home Page</a></li>
<li><a href="#lateral">Lateral</a></li>
<li><a href="#like">Like, ilike Example</a></li>
<li><a href="#limit">Limit and offset</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org33368f2" class="outline-2">
<h2 id="org33368f2"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org33368f2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-lateral" class="outline-2">
<h2 id="lateral">Lateral</h2>
<div class="outline-text-2" id="text-lateral">
<p>
Basically, the lateral keyword allows access to columns after the from statement and use them earlier in the query. Here is a sample vanilla sql query using lateral, borrowed from <a href="https://popsql.com/learn-sql/postgresql/how-to-use-lateral-joins-in-postgresql#data-set">https://popsql.com/learn-sql/postgresql/how-to-use-lateral-joins-in-postgresql#data-set</a>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 <span class="org-string">"select</span>
<span class="org-string">    pledged_usd,</span>
<span class="org-string">    avg_pledge_usd,</span>
<span class="org-string">    amt_from_goal,</span>
<span class="org-string">    duration,</span>
<span class="org-string">    (usd_from_goal / duration) as usd_needed_daily</span>
<span class="org-string"> from kickstarter_data,</span>
<span class="org-string">    lateral (select pledged / fx_rate as pledged_usd) pu</span>
<span class="org-string">    lateral (select pledged_usd / backers_count as avg_pledge_usd) apu</span>
<span class="org-string">    lateral (select goal / fx_rate as goal_usd) gu</span>
<span class="org-string">    lateral (select goal_usd - pledged_usd as usd_from_goal) ufg</span>
<span class="org-string">    lateral (select (deadline - launched_at)/86400.00 as duration) dr;"</span>)
</pre>
</div>
<p>
And now how it would be written in s-sql
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (<span class="org-builtin">:select</span> 'pledged-usd 'avg-pledge-usd 'amt-from-goal 'duration
          (<span class="org-builtin">:as</span> (<span class="org-builtin">:/</span> 'usd-from-goal 'duration) 'usd-needed-daily)
          <span class="org-builtin">:from</span> 'kickstarter-data
          <span class="org-builtin">:lateral</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:/</span> 'pledged 'fx-rate)
                                      'pledged-usd))
                        'pu)
          <span class="org-builtin">:lateral</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:/</span> 'pledged-usd 'backers-count)
                                      'avg-pledge-usd))
                        'apu)
          <span class="org-builtin">:lateral</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:/</span> 'goal 'fx-rate)
                                      'goal-usd))
                        'gu)
          <span class="org-builtin">:lateral</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:-</span> 'goal-usd 'pledged-usd)
                                      'usd-from-goal))
                        'ufg)
          <span class="org-builtin">:lateral</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:/</span> (<span class="org-builtin">:-</span> 'deadline 'launched-at) 86400.00)
                                      'duration))
                        'dr)))
</pre>
</div>
<p>
Here is an example with :join-lateral
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
   (<span class="org-builtin">:select</span> '*
    <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'tags 't1)
    <span class="org-builtin">:join-lateral</span> (<span class="org-builtin">:as</span>
                   (<span class="org-builtin">:fetch</span>
                    (<span class="org-builtin">:order-by</span>
                     (<span class="org-builtin">:select</span> 'm.*
                      <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'movies 'm)
                      <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'm.tag-id 't1.id))
                     (<span class="org-builtin">:desc</span> 'm.created-at))
                    2)
                   'e1)
    <span class="org-builtin">:on</span> (<span class="org-builtin">:=</span> 1 1)))
</pre>
</div>
<p>
This one has an :inner-join-lateral
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
      (<span class="org-builtin">:select</span> '*
       <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'tags 't1)
       <span class="org-builtin">:inner-join-lateral</span> (<span class="org-builtin">:as</span>
                            (<span class="org-builtin">:fetch</span>
                             (<span class="org-builtin">:order-by</span>
                              (<span class="org-builtin">:select</span> 'm.*
                               <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'movies 'm)
                               <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'm.tag-id 't1.id))
                              (<span class="org-builtin">:desc</span> 'm.created-at))
                             2)
                            'e1)
       <span class="org-builtin">:on</span> 't))
</pre>
</div>
<p>
A :cross-join-lateral
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
   (<span class="org-builtin">:select</span> '*
    <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'tags 't1)
    <span class="org-builtin">:cross-join-lateral</span> (<span class="org-builtin">:as</span>
                         (<span class="org-builtin">:fetch</span>
                          (<span class="org-builtin">:order-by</span>
                           (<span class="org-builtin">:select</span> 'm.*
                            <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'movies 'm)
                            <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'm.tag-id 't1.id))
                           (<span class="org-builtin">:desc</span> 'm.created-at))
                          2)
                         'e1)))

  (query
   (<span class="org-builtin">:select</span> 'geo.zipcode 'geo.state 'movie.name
    <span class="org-builtin">:from</span> 'geo
    <span class="org-builtin">:cross-join-lateral</span>
    (<span class="org-builtin">:as</span>
     (<span class="org-builtin">:limit</span>
      (<span class="org-builtin">:order-by</span>
       (<span class="org-builtin">:select</span> 'movie-name
        <span class="org-builtin">:from</span> 'streams
        <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'geo.zipcode 'streams.zipcode))
       (<span class="org-builtin">:desc</span> 'streams.country))
      5)
     (<span class="org-builtin">:movie</span> 'name))))
</pre>
</div>
<p>
And a :left-join-lateral
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
   (<span class="org-builtin">:select</span> 'p.* (<span class="org-builtin">:as</span> 'dads.id 'dad-id) (<span class="org-builtin">:as</span> 'moms.id 'mom-id)
    <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'people 'p)
    <span class="org-builtin">:left-join-lateral</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:select</span> '*
                             <span class="org-builtin">:from</span> 'people
                             <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'gender <span class="org-string">"m"</span>)
                                          (<span class="org-builtin">:=</span> 'surname-1 'p.surname-1)
                                          (<span class="org-builtin">:&lt;&gt;</span> 'pack-id 'p.pack-id)))
                            'dads)
    <span class="org-builtin">:on</span> 't
    <span class="org-builtin">:left-join-lateral</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:select</span> '*
                             <span class="org-builtin">:from</span> 'people
                             <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'gender <span class="org-string">"f"</span>)
                                          (<span class="org-builtin">:=</span> 'surname-1 'p.surname-2)
                                          (<span class="org-builtin">:&lt;&gt;</span> 'pack-id 'p.pack-id)
                                          (<span class="org-builtin">:&lt;&gt;</span> 'pack-id 'dads.pack-id)))
                            'moms)
    <span class="org-builtin">:on</span> 't))
</pre>
</div>
</div>
</div>
<div id="outline-container-like" class="outline-2">
<h2 id="like">Like, ilike Example</h2>
<div class="outline-text-2" id="text-like">
<p>
The sql like operator provides a little bit of fuzzy string matching in a search. The following is a simple example using the sql like operator in s-sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:like</span> 'name <span class="org-string">"%New%"</span>)))

((103 <span class="org-string">"New Caledonia"</span>) (58 <span class="org-string">"New Zealand"</span>) (108 <span class="org-string">"Papua New Guinea"</span>))

</pre>
</div>

<p>
The sql ilike operator provides the same thing, but on a case insensitive basis. The following is a simple example using the sql ilike operator in s-sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:like</span> 'name <span class="org-string">"%NEW%"</span>)))

((103 <span class="org-string">"New Caledonia"</span>) (58 <span class="org-string">"New Zealand"</span>) (108 <span class="org-string">"Papua New Guinea"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-limit" class="outline-2">
<h2 id="limit">Limit and offset</h2>
<div class="outline-text-2" id="text-limit">
<p>
Note that  :limit has 2 possible parameters, the limit and the offset. Note that the :order-by and :limit forms are wrapped around the :select form. The only difference between the two queries is the offset parameter.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((list-limit 2)
      (offset 0))
  (query
   (<span class="org-builtin">:limit</span>
    (<span class="org-builtin">:order-by</span>
     (<span class="org-builtin">:select</span> 'countries.id 'countries.name
              <span class="org-builtin">:from</span> 'countries)
     'name)
    '$1 '$2)
   list-limit offset))

((82 <span class="org-string">"Afghanistan"</span>) (130 <span class="org-string">"Albania"</span>))

(<span class="org-keyword">let</span> ((list-limit 2) (offset 2))
  (query
   (<span class="org-builtin">:limit</span>
    (<span class="org-builtin">:order-by</span>
     (<span class="org-builtin">:select</span> 'countries.id 'countries.name
              <span class="org-builtin">:from</span> 'countries)
     'name)
    '$1 '$2)
   list-limit offset))

((140 <span class="org-string">"Algeria"</span>) (34 <span class="org-string">"All"</span>))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>